Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/include/cy_audio_sw_codecs.h
/*
 * Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/**
 * @file cy_audio_sw_codecs.h
 *
 * @brief This file is the header file for audio software codec library.
 * This library support encoding and decoding operation over various codecs
 */

#ifndef __CY_AUDIO_SW_CODECS_H__
#define __CY_AUDIO_SW_CODECS_H__

#ifdef __cplusplus
extern "C"
{
#endif

#include "cy_result.h"
#include "cy_audio_sw_codecs_log.h"
#include "cy_audio_sw_codecs_errors.h"
#if ENABLE_SBC_DECODE
#include "cy_asc_config_sbc_decoder.h"
#endif
#if ENABLE_SBC_ENCODE
#include "cy_asc_config_sbc_encoder.h"
#endif

#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/*******************************************************************************
 *                      Macros
 ******************************************************************************/

/*******************************************************************************
 *                      Constants
 ******************************************************************************/

/*******************************************************************************
 *                      Enumerations
 ******************************************************************************/

/**
 * Codec Type
 */
typedef enum
{
    /**
     * Invalid Codec type
     */
    CY_AUDIO_CODEC_TYPE_UNKNOWN,
    /**
     * LC3
     */
    CY_AUDIO_CODEC_TYPE_LC3,
    /**
     * OPUS
     */
    CY_AUDIO_CODEC_TYPE_OPUS,
    /**
     * SBC
     */
    CY_AUDIO_CODEC_TYPE_SBC,
    /**
     * MP3
     */
    CY_AUDIO_CODEC_TYPE_MP3,
    /**
     * AAC
     */
    CY_AUDIO_CODEC_TYPE_AAC,
    /**
     * OGG
     */
    CY_AUDIO_CODEC_TYPE_OGG,
    /**
     * Codec type maximum
     */
    CY_AUDIO_CODEC_TYPE_MAX

} cy_audio_sw_codec_type_t;

/**
 * Codec Operation
 */
typedef enum
{
    /**
     * Codec Operation Invalid
     */
    CY_AUDIO_CODEC_OPERATION_INVALID,
    /**
     * Encode operation
     */
    CY_AUDIO_CODEC_OPERATION_ENCODE,
    /**
     * Decode operation
     */
    CY_AUDIO_CODEC_OPERATION_DECODE,

    /**
     * Codec Operation Max
     */
    CY_AUDIO_CODEC_OPERATION_MAX

} cy_audio_sw_codec_operation_t;

/**
 * Sampling Rate
 */
typedef enum
{
    /**
     * Sampling Rate Invalid
     */
    CY_AUDIO_CODEC_SAMPLING_RATE_INVALID,

    /**
     * Sampling Rate Unknown
     */
    CY_AUDIO_CODEC_SAMPLING_RATE_UNKNOWN,

    /**
     * Sampling Rate 16KHz
     */
    CY_AUDIO_CODEC_SAMPLING_RATE_16000HZ,
    /**
     * Sampling Rate 32KHz
     */
    CY_AUDIO_CODEC_SAMPLING_RATE_32000HZ,
    /**
     * Sampling Rate 44.1KHz
     */
    CY_AUDIO_CODEC_SAMPLING_RATE_44100HZ,
    /**
     * Sampling Rate 48KHz
     */
    CY_AUDIO_CODEC_SAMPLING_RATE_48000HZ,
    /**
     * Sampling Rate Maximum
     */
    CY_AUDIO_CODEC_SAMPLING_RATE_MAX

} cy_audio_sw_codec_sampling_rate_t;

/**
 * Audio channel information
 */
typedef enum
{
    /**
     * Channels Invalid
     */
    CY_AUDIO_CODEC_CHANNEL_INVALID,
    /**
     * Channel information unknown
     */
    CY_AUDIO_CODEC_CHANNEL_UNKNOWN,
    /**
     * Channel Mono
     */
    CY_AUDIO_CODEC_CHANNEL_MONO,
    /**
     * Channels Stereo
     */
    CY_AUDIO_CODEC_CHANNEL_STEREO,
    /**
     * Channels Maximum supported
     */
    CY_AUDIO_CODEC_CHANNEL_MAX

} cy_audio_sw_codec_channel_t;

/**
 * Audio bitwidth information
 */
typedef enum
{
    /**
     * Bitwidth Invalid
     */
    CY_AUDIO_CODEC_BITWIDTH_INVALID,
    /**
     * Bitwidth of audio unknown
     */
    CY_AUDIO_CODEC_BITWIDTH_UNKNOWN,
    /**
     * Bitwidth 16 bit
     */
    CY_AUDIO_CODEC_BITWIDTH_16,
    /**
     * Bitwidth 24 bit
     */
    CY_AUDIO_CODEC_BITWIDTH_24,
    /**
     * Bitwidth 32 bit
     */
    CY_AUDIO_CODEC_BITWIDTH_32,
    /**
     * Bitwidth Maximum
     */
    CY_AUDIO_CODEC_BITWIDTH_MAX

} cy_audio_sw_codec_bitwidth_t;

typedef enum
{
    /**
     * Bitwidth Invalid
     */
    CY_AUDIO_CODEC_BITRATE_INVALID,
    /**
     * Bitwidth of audio unknown
     */
    CY_AUDIO_CODEC_BITRATE_UNKNOWN,
    /**
     * bitrate @ 32kbps
     */
    CY_AUDIO_CODEC_BITRATE_32kbps,
    /**
     * bitrate @ 64kbps
     */
    CY_AUDIO_CODEC_BITRATE_64kbps,
    /**
     * bitrate @ 96kbps
     */
    CY_AUDIO_CODEC_BITRATE_96kbps,
    /**
     * bitrate @ 128kbps
     */
    CY_AUDIO_CODEC_BITRATE_128kbps,
    /**
     * bitrate @ 192kbps
     */
    CY_AUDIO_CODEC_BITRATE_196kbps,
    /**
     * bitrate @ 320kbps
     */
    CY_AUDIO_CODEC_BITRATE_320kbps,
    /**
     * Bitrate Maximum
     */
    CY_AUDIO_CODEC_BITRATE_MAX

} cy_audio_sw_codec_bitrate_t;

