Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/include/cy_audio_sw_codecs.h
typedef enum
{
    /**
     * Frame ms Invalid
     */
    CY_AUDIO_CODEC_FRAME_MS_INVALID,
    /**
     * Frame mso unknown
     */
    CY_AUDIO_CODEC_FRAME_MS_UNKNOWN,
    /**
     * Frame 10 ms
     */
    CY_AUDIO_CODEC_FRAME_MS_10,
    /**
     * Frame 20 ms
     */
    CY_AUDIO_CODEC_FRAME_MS_20,

    /**
     * fame ms Maximum
     */
    CY_AUDIO_CODEC_FRAME_MS_MAX

} cy_audio_sw_codec_frame_ms_t;

/*******************************************************************************
 *                      Type Definitions
 ******************************************************************************/

/**
 * audio software codec instance
 */
typedef void* cy_audio_sw_codec_t;

/*******************************************************************************
 *                      Structures
 ******************************************************************************/

/**
 * Audio Software Codec decode specific configuration.
 */
typedef union
{
    /**
     * To avoid build error in case no additional config
     */
    void *Empty;

#if ENABLE_SBC_DECODE
    /**
     * Additional struct specific to SBC codec
     */
    cy_asc_sbc_decode_config_t sbc;
#endif

}cy_audio_sw_codec_specific_decode_config_t;

/**
 * Audio Software Codec Encode specific configuration.
 */
typedef union
{
    /**
     * To avoid build error in case no additional config
     */
    void *Empty;

#if ENABLE_SBC_ENCODE
    /**
     * Additional struct specific to SBC codec
     */
    cy_asc_sbc_encode_config_t sbc;
#endif

}cy_audio_sw_codec_specific_encode_config_t;


/**
 * Audio Software Codec Encode specific stream info.
 */
typedef union
{
    /**
     * To avoid build error in case no additional config
     */
    void *Empty;

#if ENABLE_SBC_DECODE
    /**
     * Additional struct specific to SBC codec
     */
    cy_asc_sbc_decode_stream_info_t sbc;
#endif
}cy_audio_sw_codec_decode_stream_info_t;

/**
 * Stream information. After decoding the headers, the decoder would use this
 * structure to notify the application about the input stream details.
 */
typedef struct
{
    /**
     * Sampling Rate
     */
    cy_audio_sw_codec_sampling_rate_t sampling_rate;
    /**
     * Audio channel information
     */
    cy_audio_sw_codec_channel_t channel;
    /**
     * Audio bit-width information
     */
    cy_audio_sw_codec_bitwidth_t bitwidth;

    cy_audio_sw_codec_decode_stream_info_t codec_specific_info;

} cy_audio_sw_codec_stream_info_t;


/*******************************************************************************
 *                      Callback Definitions
 ******************************************************************************/
/**
 * Stream information callback. Once the software codec (decoder) instance
 * identifies the stream information  like, sampling rate, channels, bitwidth
 * then, decoder instance will provide callback to the application. Application
 * can understand the decoded stream information.
 *
 * This callback would be called whenever there is a change in the stream
 * information .
 *
 * @param[in] handle                Handle to the software codec (decoder) instance
 *                                  2. Application can hold the buffer pointers
 *                                  and post it to next MW for its processing.
 * @param[in] stream_info           Information about decoded stream.
 * @param[in] callback_user_arg     User argument passed in \ref cy_audio_sw_codec_init
 *                                  using \ref cy_audio_sw_codec_decode_config_t
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 */
typedef cy_rslt_t (*cy_audio_sw_codec_decode_stream_info_callback_t)(
        cy_audio_sw_codec_t handle,
        cy_audio_sw_codec_stream_info_t stream_info,
        void *callback_user_arg);

/*******************************************************************************
 *                      API Interface Structures
 ******************************************************************************/

/**
 * Audio Software Codec Encode configuration.
 */
typedef struct
{
    /**
     * Codec type used for encoding, Following are the supported codecs for
     * Encoding:
     *      1. CY_AUDIO_CODEC_TYPE_LC3
     *      2. CY_AUDIO_CODEC_TYPE_OPUS
     *  Other codecs are not supported for encoding
     */
    cy_audio_sw_codec_type_t codec_type;

    /**
     * Sampling rate
     */
    cy_audio_sw_codec_sampling_rate_t sampling_rate;

    /**
     * Channel informations
     */
    cy_audio_sw_codec_channel_t channel;

    /**
     * Bit-width informations
     */
    cy_audio_sw_codec_bitwidth_t bitwidth;

    /**
     * bitrate informations
     */
    cy_audio_sw_codec_bitrate_t bitrate;

    /**
     * frame duration informations
     */
    cy_audio_sw_codec_frame_ms_t frame_ms;

    /**
     * Additional config based on codec usage
     */
    cy_audio_sw_codec_specific_encode_config_t codec_specific_config;

} cy_audio_sw_codec_encode_config_t;

/**
 * Audio Software Codec Decode configuration.
 */
typedef struct
{
    /**
     * Codec used for decoding
     */
    cy_audio_sw_codec_type_t codec_type;

    /**
     * Sampling rate of the data.
     *
     * Application needs to provide this parameter compulsorily if the data
     * to be decoded is not having the codec header (example: lc3 header).
     * i.e.,If the codec header is not available in the stream and if the application
     * has not passed this information, then codec-mw will not be able to decode
     * any data.
     *
     * If the data to be decoded has the codec header, then codec-mw will internally
     * parse the codec header and extract this information. In this case,
     * Application can optionally provide this parameter if it is known already,
     * if this information is not known then application can pass
     * CY_AUDIO_CODEC_SAMPLING_RATE_UNKNOWN.
     */
    cy_audio_sw_codec_sampling_rate_t sampling_rate;

    /**
     * Channel informations of the data.
     *
     * Application needs to provide this parameter compulsorily if the data
     * to be decoded is not having the codec header (example: lc3 header).
     * i.e.,If the codec header is not available in the stream and if the application
     * has not passed this information, then codec-mw will not be able to decode
     * any data.
     *
     * If the data to be decoded has the codec header, then codec-mw will internally
     * parse the codec header and extract this information. In this case,
     * Application can optionally provide this parameter if it is known already,
     * if this information is not known then application can pass
     * CY_AUDIO_CODEC_CHANNEL_UNKNOWN.
     */
    cy_audio_sw_codec_channel_t channel;

    /**
     * Bitwidth information
     *
     * Application needs to provide this parameter compulsory if the data
     * to be decoded is not having the codec header (example: lc3 header).
     * i.e.,If the codec header is not available in the stream and if the application
     * has not passed this information, then codec-mw will not be able to decode
     * any data.
     *
     * If the data to be decoded has the codec header, then codec-mw will internally
     * parse the codec header and extract this information. In this case,
     * Application can optionally provide this parameter if it is known already,
     * if this information is not known then application can pass
     * CY_AUDIO_CODEC_BITWIDTH_UNKNOWN.
     *
     */
    cy_audio_sw_codec_bitwidth_t bitwidth;

    /**
     * Application specific user argument, Passed argument will be passed
     * back to application in the MW callbacks
     * \ref: cy_audio_sw_codec_decode_stream_info_callback_t
     */
    void *callback_user_arg;

    /**
     * Decoded stream information callback. Used to notify application about
     * the information about the stream fed through \ref
     * cy_audio_sw_codec_decode.
     *
     * Dynamic change of stream info is not supported. Change in the stream info
     * is notified via this callback and application is expected to do deinit and init
     * and decode new data.
     */
    cy_audio_sw_codec_decode_stream_info_callback_t stream_info;


    /**
     * Additional config based on codec usage
     */
    cy_audio_sw_codec_specific_decode_config_t codec_specific_config;

} cy_audio_sw_codec_decode_config_t;

