Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/include/cy_audio_sw_codecs.h
/*******************************************************************************
 *                      Global Variables
 ******************************************************************************/

/*******************************************************************************
 *                      Function Declarations
 ******************************************************************************/

/**
 * Initializes the software codec for either decoding and encoding.
 *
 * @param[in]  codec_operation      Codec operation to be done (either encode
 *                                  / decode)
 * @param[in]  codec_config         Codec configuration parameter.
 *                                  1) If the codec_operation refers to
 *                                  CY_AUDIO_CODEC_OPERATION_ENCODE, then the
 *                                  codec_config should corresponds to
 *                                  cy_audio_sw_codec_encode_config_t
 *                                  2) If the codec_operation refers to
 *                                  CY_AUDIO_CODEC_OPERATION_DECODE, then the
 *                                  codec_config should corresponds to
 *                                  cy_audio_sw_codec_decode_config_t
 * @param[out]  handle              Pointer to store the audio software codec
 *                                  instance
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 */
cy_rslt_t cy_audio_sw_codec_init(
        cy_audio_sw_codec_operation_t codec_operation,
        void *codec_config,
        cy_audio_sw_codec_t *handle);

/**
 * Encodes the input PCM data and returns the encoded data.
 *
 * @param[in]  handle               Handle to the software codec instance
 * @param[in]  in_pcm_buff          Pointer to input PCM data buffer.
 * @param[in/out]  in_pcm_data_len  1) Length of the input data referred by in_pcm_buff.
 *                                  2) Once the API returns, return number of bytes
 *                                  processed/accepted successfully in the codec-mw
 *                                  as part of processing.
 * @param[in]  out_buff             Pointer to output encoded buffer
 * @param[in/out]  outbuf_len       1) Length of the output buffer.
 *                                  2) Once the API returns, return number of bytes
 *                                  filled in the out_buff will be returned in the
 *                                  outbuf_len pointer.
 * @return      uint32_t            On error a negative value is returned. On
 *                                  success, zero or the number of bytes used to
 *                                  encode the data read from the input buffer.
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 */
cy_rslt_t cy_audio_sw_codec_encode(
        cy_audio_sw_codec_t handle,
        uint8_t *in_pcm_buff,
        uint32_t *in_pcm_data_len,
        uint8_t *out_buff,
        uint32_t *outbuf_len);

/**
 * Decodes the encoded data and returns the PCM data.
 *
 * @param[in]  handle               Handle to the software codec instance
 * @param[in]  in_encoded_buff      Pointer to input encoded data.
 * @param[in]  in_encoded_data_len  1) Length of the input data referred by in_encoded_data_len.
 *                                  2) Once the API returns, return number of bytes
 *                                  processed/accepted successfully in the codec-mw
 *                                  as part of processing.
 * @param[in]  out_buff             Pointer to output PCM data
 * @param[in/out]  outbuf_len       1) Length of the output buffer.
 *                                  2) Once the API returns, return number of bytes
 *                                  filled in the output buffer will be returned
 *                                  in the outbuf_len pointer.
 * @return      uint32_t            On error a negative value is returned,
 *                                  otherwise the number of bytes used or zero
 *                                  if no frame data was decompressed (used)
 *                                  from the input buffer.
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            CY_RSLT_ASC_HEADER_NOT_FOUND - error code if no stream info provided
 *                                           during init and no header found in
 *                                           buffer "in_encoded_buff".
 */
cy_rslt_t cy_audio_sw_codec_decode(
        cy_audio_sw_codec_t handle,
        uint8_t *in_encoded_buff,
        uint32_t *in_encoded_data_len,
        uint8_t *out_buff,
        uint32_t *outbuf_len);

/**
 * Get the recommended size of the input buffer for the codec encode
 * operation configured.
 *
 *  1.  Input size can be any length but suggested to have multiples
 *      of the recommended size.
 *  2.  For optimal, suggested passing multiples of recommended input,
 *      so that internal copy could be avoided.
 *  3.  use api cy_audio_sw_codec_get_encoder_recommended_outbuf_size
 *      to get the recommended output size for the input size.
 *  4.  Since it is PCM data length is fixed for provided config (sample rate,  bit width, channel ),
 *      accurate prediction is possible for input.
 *
 * @param[in] handle                Handle to the software codec instance
 * @param[out] recommended_in_size  Recommended Input buffer size
 * @return cy_rslt_t                on success; an error code on failure.
 */
cy_rslt_t cy_audio_sw_codec_get_encoder_recommended_inbuf_size(
        cy_audio_sw_codec_t handle,
        uint32_t *recommended_in_size);

/**
 * Get the recommended size of the output buffer for the codec encoding
 * operation configured. Input buffer size is provided to get the
 * corresponding output buffer recommendation
 *
 * @param[in] handle                Handle to the software codec instance
 * @param[in] in_size               Input buffer size corresponding to the output buffer size
 * @param[out] recommended_out_size Recommended Output buffer size
 * @return cy_rslt_t                on success; an error code on failure.
 */
cy_rslt_t cy_audio_sw_codec_get_encoder_recommended_outbuf_size(
        cy_audio_sw_codec_t handle,
        uint32_t in_size,
        uint32_t *recommended_out_size);

/**
 * Get the recommended size of the output buffer for the codec decoding
 * operation configured.
 *
 *  1.  if the application knows the stream info prior, this API call can
 *      be invoked at any point in time.
 *
 *  2.  if the application doesn't know the stream info prior, application
 *      can all the cy_audio_sw_codec_decode_stream_info_header and get
 *      the stream info and then call this API to get the right recommended
 *      out size.
 *
 * @param[in] handle                Handle to the software codec instance
 * @param[in] stream_info           Information about decoded stream.
 * @param[out] recommended_out_size Recommended Output buffer size
 * @return cy_rslt_t                on success; an error code on failure.
 */
cy_rslt_t cy_audio_sw_codec_get_decoder_recommended_outbuf_size(
        cy_audio_sw_codec_t handle,
        cy_audio_sw_codec_stream_info_t *stream_info,
        uint32_t *recommended_out_size);

/**
 * Parse the header information from the input encoded data, used with decoder.
 * This API can be used by the application to know the stream information, so that
 *  'cy_audio_sw_codec_get_decoder_recommended_outbuf_size' can give the right
 * output size for 'cy_audio_sw_codec_decode' api.
 *
 * @param[in] handle                    Handle to the software codec instance
 * @param[in] in_encoded_buff           Pointer to input encoded data.
 * @param[in/out] in_encoded_data_len   1) Length of the input data referred by in_encoded_data_len.
 *                                      2) Once the API returns, return number of bytes
 *                                         processed/accepted successfully in the codec-mw
 *                                         as part of processing.
 * @param[out] stream_info
 * @return cy_rslt_t                    on success,
 *                                      in_encoded_data_len             - Offset to the end of header.
 *
 *                                      an error code on failure,
 *                                      1. CY_RSLT_ASC_HEADER_NOT_FOUND - no input data is accepted.
 *                                                                        appl should send next buffers
 *                                      2. CY_RSLT_ASC_PARTIAL_HEADER_IDENTIFIED
 *                                                                      - returns accepted data in in_encoded_data_len,
 *                                                                        appl can provide continuous data
 */
cy_rslt_t cy_audio_sw_codec_decode_stream_info_header(
            cy_audio_sw_codec_t handle,
            uint8_t *in_encoded_buff,
            uint32_t *in_encoded_data_len,
            cy_audio_sw_codec_stream_info_t *stream_info);

/**
 * Deinit the software codec instance.
 *
 * @param[out]  handle     Address of the Handle to audio software codec
 *                         instance created by the \ref cy_audio_sw_codec_init
 *                         API.Once API returns\ref cy_audio_sw_codec_t handle
 *                         will be reset to NULL.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 */
cy_rslt_t cy_audio_sw_codec_deinit(cy_audio_sw_codec_t *handle);

#ifdef __cplusplus
}
#endif

#endif /* __CY_AUDIO_SW_CODECS_H__ */
